# language: ru
Функция: Бронирование билетов в приложении «Идёмвкино»
  Как пользователь кинотеатра
  Я хочу бронировать билеты на фильм
  Чтобы посмотреть его в удобное время

  Предыстория:
    Дано я открыла приложение «Идёмвкино» и выбрала дату

  Сценарий: HP-1 Успешное бронирование одного свободного места
    Когда я выбираю первый фильм и сеанс
    И я выбираю свободное место
    И я нажимаю кнопку «Забронировать»
    Тогда я вижу заголовок подтверждения «Вы выбрали билеты»

  Сценарий: HP-2 Название фильма на странице подтверждения совпадает с выбранным
    Когда я выбираю первый фильм и сеанс
    И я выбираю свободное место
    И я нажимаю кнопку «Забронировать»
    Тогда название фильма на странице подтверждения совпадает с выбранным

  Сценарий: SP-1 Кнопка «Забронировать» неактивна без выбора места
    Когда я выбираю первый фильм и сеанс
    Тогда кнопка «Забронировать» неактивна